Revit 2027 API
ModelText.Subcategory Property
The subcategory.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Category Subcategory { get; set; }
Public Property Subcategory As Category
	Get
	Set
public:
property Category^ Subcategory {
	Category^ get ();
	void set (Category^ value);
}
member Subcategory : Category with get, set
Property Value
Category
Remarks
The subcategory can be set to either the family category or one of its subcategories.
See Also
Reference
ModelText Class
Autodesk.Revit.DB Namespace